# Setup and data loading

In [1]:
library(tidyverse) # load needed code libraries

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.5.1     ✔ tibble    3.2.1
✔ lubridate 1.9.4     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In R, `<-` is used to assign something a name you can refer to later. In the below, `<- read_tsv()` is used to read in a table from a file, and name it `finnish_deaths`. 

After that, `|>` (the "pipe" operator) is used to pipe the table as input into various other functionalities. 
In this case, we're first piping the data into a function that prints summaries of each of the columns. 

Then, for the next thing we want to do, we actually use two pipes. This means that the output of the first function is fed into the second one. Here, the first function (`slice_sample(n=10)`) takes the table as input and returns a new table with just 10 random rows from the original. This truncated table is then piped to `View()` for printing. 

(At any point, you could also assign the intermediate output a name and then use that later, but often it's just easier to write the whole transformation and application pipeline together using multiple pipe operations. E.g in the below, you could also have:
```r
ten_random_rows_of_finnish_deaths <- finnish_deaths |> slice_sample(n=10)
ten_random_rows_of_finnish_deaths |> View()
```
)

In [2]:
finnish_deaths <- read_tsv("Finnish_deaths_1980-2020.tsv", col_types=cols(year='i', sex='f', age='i')) # load data
finnish_deaths |> summary() # print summary information on columns
finnish_deaths |> slice_sample(n=10) |> View() # print 10 random rows.

      year          sex               age
 Min.   :1980   male  :1015800   Min.   :  0.00
 1st Qu.:1990   female:1011585   1st Qu.: 66.00
 Median :2001                    Median : 77.00
 Mean   :2001                    Mean   : 73.82
 3rd Qu.:2011                    3rd Qu.: 85.00
 Max.   :2020                    Max.   :112.00

   year sex    age
1  2002 female 92
2  2019 male   81
3  2000 female 83
4  1999 female 90
5  1997 male   73
6  1990 female 81
7  1983 female 92
8  1996 female 70
9  1988 female 66
10 2011 male   56

In [42]:
skvr <- read_tsv("skvr.tsv", col_types=cols(poem_id='c', collector_name='f', collection_year='i', collection_place='f', n_verses='i')) # load data
summary(skvr) # print summary information on columns
View(skvr |> slice_sample(n=10)) # print 10 random rows.

   poem_id                      collector_name  collection_year
 Length:85172       Krohn, Kaarle      : 4013   Min.   :1564
 Class :character   Alava, Vihtori     : 3081   1st Qu.:1885
 Mode  :character   Europaeus, D. E. D.: 2768   Median :1901
                    Paulaharju, Samuli : 2709   Mean   :1897
                    Neovius, A. D.     : 2511   3rd Qu.:1915
                    Porkka, Volmari    : 2421   Max.   :1939
                    (Other)            :67669
    collection_place    n_verses
 Narvusi    : 3197   Min.   :  1.0
 Lempaala   : 2954   1st Qu.:  4.0
 Vuokkiniemi: 2179   Median :  7.0
 Soikkola   : 1763   Mean   : 15.2
 Rautu      : 1728   3rd Qu.: 17.0
 Ilomantsi  : 1566   Max.   :571.0
 (Other)    :71785

   poem_id                 collector_name
1  SKVR VII3 loitsut 219.  Krohn, Kaarle
2  SKVR VI1 2609.          Kouvo, Henrik
3  SKVR VII1 629.          Härkönen, Iivo
4  SKVR VIII 2885.         Saariluoma, Vilho
5  SKVR I3 1768.           Europaeus, D. E. D.
6  SKVR IX1 1806.          Vihervaara, Eemeli
7  SKVR XIV 822.           Vaara, V. B.
8  SKVR XII1 2690.         Perä-Pohjolan ja Lapin Kotiseutuyhdistys
9  SKVR VII4 loitsut 1675. Krohn, Kaarle
10 SKVR VI2 4477.          Schadewitz, Martti
   collection_year collection_place n_verses
1  1885            Juuka            34
2  1889            Lemi              2
3  1903            Ilomantsi        15
4  1913            Sauvo             4
5  1845            Suomussalmi      24
6  1910            Tammela           3
7  1912            Mäntsälä         16
8  1915            Alatornio         6
9  1885            Kaavi            55
10 1900            Juva              4

In [43]:
ceec_people <- read_tsv("ceec_people.tsv", col_types=cols(person_id='c', sex='f', first_name='c', last_name='c', year_of_birth='i', year_of_death='i', living_region='f', societal_rank='f', societal_rank_of_father='f', religion='f', level_of_education='f', letters_sent='i', letters_received='i')) # load data
summary(ceec_people) # print summary information on columns
View(ceec_people |> slice_sample(n=10)) # print 10 random rows.

  person_id             sex        first_name         last_name
 Length:2050        Female: 476   Length:2050        Length:2050
 Class :character   Male  :1561   Class :character   Class :character
 Mode  :character   NA's  :  13   Mode  :character   Mode  :character




 year_of_birth  year_of_death        living_region        societal_rank
 Min.   :1360   Min.   :1408   Other        :510   Gentry (lower):367
 1st Qu.:1560   1st Qu.:1606   London       :358   Nobility      :320
 Median :1628   Median :1672   East Anglia  :182   Gentry (upper):291
 Mean   :1626   Mean   :1673   North        :181   Professional  :291
 3rd Qu.:1714   3rd Qu.:1765   Home counties:149   Other         :179
 Max.   :1784   Max.   :1857   (Other)      :245   (Other)       :466
 NA's   :976    NA's   :772    NA's         :425   NA's          :136
   societal_rank_of_father       religion      level_of_education
 Gentry (lower):306        Protestant:  61   Higher     : 579
 Gentry (upper):265        Anglican  :  44   Private    :  49
 Nobility      :223        Catholic  :  45   Apprenticed:  64
 Professional  :105        NA's      :1900   Secondary  :  31
 Clergy (lower): 78                          Elementary :   6
 (Other)       :200                          NA's       :1321
 NA's          :873
  letters_sent     letters_received
 Min.   :  0.000   Min.   :  0.000
 1st Qu.:  0.000   1st Qu.:  0.000
 Median :  1.000   Median :  1.000
 Mean   :  5.771   Mean   :  5.771
 3rd Qu.:  4.000   3rd Qu.:  3.000
 Max.   :189.000   Max.   :308.000

   person_id sex    first_name  last_name            year_of_birth
1  SBYRON    Female Sophia      Byron née Trevannion   NA
2  WASTON    Male   Walter      Aston                1584
3  N2BACON   Male   NICHOLAS II BACON                1543
4  JTILSON   Male   John        Tilson                 NA
5  WHEWER    Male   William     Hewer                1642
6  LMARESCOE Female Leonora     Marescoe             1640
7  IJONES    Male   INIGO       JONES                1573
8  JNORBURY  Male   JOHN        NORBURY                NA
9  JMOWBRJR  Male   JOHN        MOWBRAY              1444
10 H5PERCY   Male   Henry       Percy                1478
   year_of_death living_region societal_rank  societal_rank_of_father religion
1  1790          London        Gentry (lower) NA                      NA
2  1639          Court         Nobility       Gentry (upper)          NA
3  1624          East Anglia   Gentry (upper) Gentry (upper)          NA
4    NA          Other         Gentry (lower) NA                      NA
5  1715          London        Professional   Professional            NA
6  1715          London        Merchant       NA                      NA
7  1652          London        Professional   Other                   NA
8    NA          Other         Other          NA                      NA
9  1476          East Anglia   Nobility       Nobility                NA
10 1527          North         Nobility       Nobility                NA
   level_of_education letters_sent letters_received
1  NA                  0           5
2  NA                  0           3
3  Higher              7           4
4  NA                  0           1
5  NA                  0           1
6  NA                  0           2
7  NA                  1           0
8  NA                  1           0
9  NA                  3           1
10 NA                 17           0